title: str = 'Water reserves'

version: str = '1.0.0'
    
description:str = """
# Πλατφόρμα διαχείρισης και ανάλυσης δεδομένων υδάτινων πόρων
Συνοπτικά περιλαμβάνονται:
* **Τρέχουσα κατάσταση** αποθεμάτων, παραγωγής νερού και μετεωρολογικών δεδομένων
* Αναζητήσεις δεδομένων για τα **αποθέματα νερού**
* Αναζητήσεις δεδομένων για την **παραγωγή πόσιμου νερού**
* Αναζητήσεις δεδομένων για τον **υετό** και τις **θερμοκρασίες**
* Αναζητήσεις δεδομένων για τις **διακοπές/ βλάβες** υδροδότησης
"""

tag_home: str = '0. Διαθεσιμότητα εξυπηρετητή'
tag_status: str = '1. Τρέχουσα κατάσταση'
tag_savings: str = '2. Αποθέματα νερού'
tag_production: str = '3. Παραγωγή πόσιμου νερού'
tag_weather: str = '4. Μετεωρολογικά δεδομένα'
tag_interruptions: str = '5. Διακοπές/ βλάβες υδροδότησης'

tags_metadata: list[ dict ] = [
    {
        "name": tag_home, 
        "description": "Ενημέρωση/ μήνυμα για τη διαθεσιμότητα του συστήματος."
    },
    {
        "name": tag_status, 
        "description": "Οι πιο πρόσφατες μετρήσεις των αποθεμάτων, της παραγωγής νερού και των μετεωρολογικών δεδομένων και οι αξιολογήσεις τους ως προς τα ιστορικά δεδομένα."
    },
    {
        "name": tag_savings, 
        "description": "Αναζήτηση δεδομένων για τα διαθέσιμα αποθέματα νερού. Επίσης κατάλογος των ταμιευτήρων."
    },
    {
        "name": tag_production, 
        "description": "Αναζήτηση δεδομένων για με την παραγωγή πόσιμου νερού. Επίσης κατάλογος των μονάδων επεξεργασίας νερού."
    },
    {
        "name": tag_weather, 
        "description": "Αναζήτηση δεδομένων για τις κατακριμνήσεις υετού και τα επίπεδα θερμοκρασίας. Επίσης κατάλογος των τοποθεσιών από όπου καταγράφονται οι μετρήσεις."
    },
    {
        "name": tag_interruptions, 
        "description": "Αναζήτηση δεδομένων για τις διακοπές/ βλάβες υδροδότησης. Επίσης κατάλογος των Δήμων Αττικής."
    }
]
